/*************************************************
  Function:       // 函数说明：               root_window()
  Description:    // 函数功能、性能等的描述:  显示主界面
  Calls:          // 被本函数调用的函数清单： printf
  Called By:      // 调用本函数的函数清单:    no
  Table Accessed: // 被访问的表（此项仅对于牵扯到数据库操作的程序）:no
  Table Updated:  // 被修改的表（此项仅对于牵扯到数据库操作的程序）:no
  Input:          // 输入参数说明，包括每个参数的作
                  // 用、取值说明及参数间关系。:                    no
  Output:         // 对输出参数的说明。                            :界面
  Return:         // 函数返回值的说明                              :no
  Others:         // 其它说明                                      :no
*************************************************/
#include "../../include/myhead.h"


int root_face()
{ 
    printf("                    |   你是超级用户，用有额外的权限:             | \n");
    printf("                    |---------------------------------------------| \n");
    printf("                    |   10:踢出某人(out)      11:禁言某人(ban)    | \n");
    printf("                    |---------------------------------------------| \n");
    printf("                    |   12:解禁某人(unban)                        | \n");
    printf("                    +=============================================+ \n");
    printf("\n");

    return 0;
}

